Public Attributes | List of all members
API_AngleDimensionType Struct Reference
Element Manager API
Represents an angle dimension. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
short  | linPen
Pen attribute index of dimension and witness lines.
bool  | smallArc
Show the smaller arc of a-b (inner or outer dimension).
bool  | onlyDimensionText
Only dimension texts (notes) are visible — no leader line.
API_TextPosID  | textPos
up/in/below
API_DirID  | textWay
The position of the text relative to the dimension line (see API_DirID). The possible values are: APIDir_Parallel, APIDir_Horizontal, APIDir_Perpendicular.
API_WitnessID  | witnessForm
Witness line format (see API_WitnessID).
double  | witnessVal
Gap (APIWtn_Fix) or length (APIWtn_Large) of witness line according to witnessForm.
API_MarkerData  | markerData
Marker specification (see API_MarkerData).
API_NoteType  | note
Parameters of the dimension text.
API_DimBase  | base [4]
API_Coord  | pos
Point to fit dimension arc.
API_Coord  | origo
Of dimension arc.
double  | dimVal
Angle of dimensioned items [radian].
double  | radius
Of dimension arc.
Detailed Description
Represents an angle dimension.
Member Data Documentation
◆ base
 API_DimBase API_AngleDimensionType::base[4]
◆ dimVal
 API_AngleDimensionType::dimVal
Angle of dimensioned items [radian].
◆ head
 API_AngleDimensionType::head
General element header.
◆ linPen
 API_AngleDimensionType::linPen
Pen attribute index of dimension and witness lines.
◆ markerData
 API_AngleDimensionType::markerData
Marker specification (see API_MarkerData).
◆ note
 API_AngleDimensionType::note
Parameters of the dimension text.
◆ onlyDimensionText
 API_AngleDimensionType::onlyDimensionText
Only dimension texts (notes) are visible — no leader line.
◆ origo
 API_AngleDimensionType::origo
Of dimension arc.
◆ pos
 API_AngleDimensionType::pos
Point to fit dimension arc.
◆ radius
 API_AngleDimensionType::radius
Of dimension arc.
◆ smallArc
 API_AngleDimensionType::smallArc
Show the smaller arc of a-b (inner or outer dimension).
◆ textPos
 API_AngleDimensionType::textPos
up/in/below
◆ textWay
 API_AngleDimensionType::textWay
The position of the text relative to the dimension line (see API_DirID). The possible values are: APIDir_Parallel, APIDir_Horizontal, APIDir_Perpendicular.
◆ witnessForm
 API_AngleDimensionType::witnessForm
Witness line format (see API_WitnessID).
◆ witnessVal
 API_AngleDimensionType::witnessVal
Gap (APIWtn_Fix) or length (APIWtn_Large) of witness line according to witnessForm.